In [93]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

pd.set_option('display.min_rows', 10)
pd.set_option('display.max_rows', 10)

In [94]:
# hide
df = pd.read_csv('./tidy-data/weather.csv')

In [95]:
df

,id,year,month,element,d2,d3,d5,d10,d11,d16,d23,d27,d30
0,MX17004,2010,1,tmin,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,14.5
1,MX17004,2010,1,tmax,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,27.8
2,MX17004,2010,2,tmin,14.4,14.4,NaN,NaN,13.4,NaN,10.7,NaN,NaN
3,MX17004,2010,2,tmax,27.3,24.1,NaN,NaN,29.7,NaN,29.9,NaN,NaN
4,MX17004,2010,3,tmin,NaN,NaN,14.2,16.8,NaN,17.6,NaN,NaN,NaN
5,MX17004,2010,3,tmax,NaN,NaN,32.1,34.5,NaN,31.1,NaN,NaN,NaN
6,MX17004,2010,4,tmin,NaN,NaN,NaN,NaN,NaN,NaN,NaN,16.7,NaN
7,MX17004,2010,4,tmax,NaN,NaN,NaN,NaN,NaN,NaN,NaN,36.3,NaN
8,MX17004,2010,5,tmin,NaN,NaN,NaN,NaN,NaN,NaN,NaN,18.2,NaN
9,MX17004,2010,5,tmax,NaN,NaN,NaN,NaN,NaN,NaN,NaN,33.2,NaN

In [96]:
df = pd.melt(df, id_vars=['id', 'year', 'month', 'element'],
                 value_vars=list(df.columns)[4:],
                 var_name='day_raw', value_name='value')
df = df.dropna(subset=['value'])
df

         id  year  month element day_raw  value
2   MX17004  2010      2    tmin      d2   14.4
3   MX17004  2010      2    tmax      d2   27.3
12  MX17004  2010      2    tmin      d3   14.4
13  MX17004  2010      2    tmax      d3   24.1
24  MX17004  2010      3    tmin      d5   14.2
..      ...   ...    ...     ...     ...    ...
77  MX17004  2010      4    tmax     d27   36.3
78  MX17004  2010      5    tmin     d27   18.2
79  MX17004  2010      5    tmax     d27   33.2
80  MX17004  2010      1    tmin     d30   14.5
81  MX17004  2010      1    tmax     d30   27.8

[20 rows x 6 columns]

In [97]:
# Extracting day
df["day"] = df["day_raw"].str.extract("d(\d+)", expand=False)
df

         id  year  month element day_raw  value day
2   MX17004  2010      2    tmin      d2   14.4   2
3   MX17004  2010      2    tmax      d2   27.3   2
12  MX17004  2010      2    tmin      d3   14.4   3
13  MX17004  2010      2    tmax      d3   24.1   3
24  MX17004  2010      3    tmin      d5   14.2   5
..      ...   ...    ...     ...     ...    ...  ..
77  MX17004  2010      4    tmax     d27   36.3  27
78  MX17004  2010      5    tmin     d27   18.2  27
79  MX17004  2010      5    tmax     d27   33.2  27
80  MX17004  2010      1    tmin     d30   14.5  30
81  MX17004  2010      1    tmax     d30   27.8  30

[20 rows x 7 columns]

In [98]:
import datetime

# To numeric values
df[["year","month","day"]] = df[["year","month","day"]].apply(lambda x: pd.to_numeric(x, errors='ignore'))

# Create a date from the different columns
def create_date_from_year_month_day(row):
    return datetime.datetime(year=row["year"], month=int(row["month"]), day=row["day"])

df["date"] = df.apply(lambda row: create_date_from_year_month_day(row), axis=1)

df

         id  year  month element day_raw  value  day       date
2   MX17004  2010      2    tmin      d2   14.4    2 2010-02-02
3   MX17004  2010      2    tmax      d2   27.3    2 2010-02-02
12  MX17004  2010      2    tmin      d3   14.4    3 2010-02-03
13  MX17004  2010      2    tmax      d3   24.1    3 2010-02-03
24  MX17004  2010      3    tmin      d5   14.2    5 2010-03-05
..      ...   ...    ...     ...     ...    ...  ...        ...
77  MX17004  2010      4    tmax     d27   36.3   27 2010-04-27
78  MX17004  2010      5    tmin     d27   18.2   27 2010-05-27
79  MX17004  2010      5    tmax     d27   33.2   27 2010-05-27
80  MX17004  2010      1    tmin     d30   14.5   30 2010-01-30
81  MX17004  2010      1    tmax     d30   27.8   30 2010-01-30

[20 rows x 8 columns]

In [99]:
df = df.drop(['year',"month","day", "day_raw"], axis=1)
df

         id element  value       date
2   MX17004    tmin   14.4 2010-02-02
3   MX17004    tmax   27.3 2010-02-02
12  MX17004    tmin   14.4 2010-02-03
13  MX17004    tmax   24.1 2010-02-03
24  MX17004    tmin   14.2 2010-03-05
..      ...     ...    ...        ...
77  MX17004    tmax   36.3 2010-04-27
78  MX17004    tmin   18.2 2010-05-27
79  MX17004    tmax   33.2 2010-05-27
80  MX17004    tmin   14.5 2010-01-30
81  MX17004    tmax   27.8 2010-01-30

[20 rows x 4 columns]

In [100]:
df = df.pivot(index=['id','date'], columns='element', values='value')
df.reset_index(inplace=True)
df

element       id       date  tmax  tmin
0        MX17004 2010-01-30  27.8  14.5
1        MX17004 2010-02-02  27.3  14.4
2        MX17004 2010-02-03  24.1  14.4
3        MX17004 2010-02-11  29.7  13.4
4        MX17004 2010-02-23  29.9  10.7
5        MX17004 2010-03-05  32.1  14.2
6        MX17004 2010-03-10  34.5  16.8
7        MX17004 2010-03-16  31.1  17.6
8        MX17004 2010-04-27  36.3  16.7
9        MX17004 2010-05-27  33.2  18.2

In [102]:
df.rename_axis('',axis=1, inplace=True)
df

        id       date  tmax  tmin
0  MX17004 2010-01-30  27.8  14.5
1  MX17004 2010-02-02  27.3  14.4
2  MX17004 2010-02-03  24.1  14.4
3  MX17004 2010-02-11  29.7  13.4
4  MX17004 2010-02-23  29.9  10.7
5  MX17004 2010-03-05  32.1  14.2
6  MX17004 2010-03-10  34.5  16.8
7  MX17004 2010-03-16  31.1  17.6
8  MX17004 2010-04-27  36.3  16.7
9  MX17004 2010-05-27  33.2  18.2